RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/MCUX_Config/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include <rtthread.h>

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

void BOARD_InitLeds(void);

#ifdef BSP_USING_LPUART1
void BOARD_InitLPUART1Pins(void);
#endif

#ifdef BSP_USING_LPUART10
void BOARD_InitLPUART10Pins(void);
#endif

#ifdef BSP_USING_LPUART12
void BOARD_InitLPUART12Pins(void);
#endif

#ifdef BSP_USING_I2C2
void BOARD_InitLPI2C2Pins(void);
#endif

#ifdef BSP_USING_I2C3
void BOARD_InitLPI2C3Pins(void);
#endif

#ifdef BSP_USING_SPI3
void BOARD_InitLPSPI3Pins(void);
#endif

#ifdef BSP_USING_SDIO
void BOARD_InitSDIO1Pins(void);
#endif

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
